pioter77/stm32f103_qt_vcom_sensors/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

#include "stm32f1xx_ll_dma.h"
#include "stm32f1xx_ll_rcc.h"
#include "stm32f1xx_ll_bus.h"
#include "stm32f1xx_ll_system.h"
#include "stm32f1xx_ll_exti.h"
#include "stm32f1xx_ll_cortex.h"
#include "stm32f1xx_ll_utils.h"
#include "stm32f1xx_ll_pwr.h"
#include "stm32f1xx_ll_spi.h"
#include "stm32f1xx_ll_gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LD1_Pin LL_GPIO_PIN_13
#define LD1_GPIO_Port GPIOC
#define Rel1_Pin LL_GPIO_PIN_1
#define Rel1_GPIO_Port GPIOA
#define Rel2_Pin LL_GPIO_PIN_2
#define Rel2_GPIO_Port GPIOA
#define Rel3_Pin LL_GPIO_PIN_3
#define Rel3_GPIO_Port GPIOA
#define Rel4_Pin LL_GPIO_PIN_4
#define Rel4_GPIO_Port GPIOA
#define MYSPI_CS_Pin LL_GPIO_PIN_8
#define MYSPI_CS_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */
#define B_SIZE 14	//buffer for sending size
#define B_END B_SIZE-1		//buffer last element index
extern uint8_t mainBuff[B_SIZE];
extern _Bool isReceiveComplete;
extern _Bool isAnswerAllowed;
extern uint8_t recBufferSPI2[64];
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
